УправлениеПлатформеннымиОбработками/src/InformationRegisters/ПодменаПлатформенныхОбработок/ПодменаПлатформенныхОбработок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодменаПлатформенныхОбработок</name>
  <resources>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияОбработки</name>
    <type>
      <types>CatalogRef.ВерсииПлатформенныхОбработок</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Обработка</name>
    <type>
      <types>CatalogRef.ПлатформенныеОбработки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеПлатформеннымиОбработками/src/InformationRegisters/ПодменаПлатформенныхОбработок/Forms/ФормаЗаписи/Module.bsl
// @strict-types

#Область ОбработчикиСобытийФормы
 
// При создании на сервере.
// 
// Параметры:
//  Отказ - Булево - Отказ
//  СтандартнаяОбработка - Булево - Стандартная обработка
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВходящаяМодифицированность = Ложь;
	Если Параметры.Свойство("Модифицированность", ВходящаяМодифицированность) Тогда
		Модифицированность = ВходящаяМодифицированность;
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура;
	Если НЕ ЗначениеЗаполнено(Запись.Владелец) 
		И Параметры.Свойство("ЗначенияЗаполнения", ПараметрыЗаполнения) Тогда
		ПараметрыЗаполнения.Свойство("Владелец", Запись.Владелец);
	КонецЕсли;
	
	ПодсистемаПользователейСуществует = УправлениеПлатформеннымиОбработками.ПодсистемаСуществуетБСП_Пользователи();
	
	ОбновитьПредставлениеПользователя();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьПредставлениеПользователя();

КонецПроцедуры

// После записи.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - Параметры записи
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//@skip-check unknown-method-property
	Если НЕ ЗначениеЗаполнено(Запись.Владелец) 
		ИЛИ Запись.Владелец = УправлениеПлатформеннымиОбработкамиВызовСервера.ИдентификаторТекущегоПользователяИБ() Тогда
		
		УправлениеПлатформеннымиОбработкамиКлиент.СпроситьИПодключитьВерсиюОбработкиДляТекущегоСеанса(Запись.ВерсияОбработки);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПредставлениеПользователя();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеПользователяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяФормыВыбора = ИмяФормыВыбораПользователя(ПодсистемаПользователейСуществует);
	
	ПараметрыВыбора = Новый Структура();
	ПараметрыВыбора.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму(ИмяФормыВыбора, ПараметрыВыбора, Элементы.ПредставлениеПользователя);

КонецПроцедуры

// Представление пользователя обработка выбора.
// 
// Параметры:
//  Элемент - ПолеФормы -  Элемент
//  ВыбранноеЗначение - УникальныйИдентификатор, Структура - :
//  * ИдентификаторПользователяИБ - УникальныйИдентификатор
//  СтандартнаяОбработка - Булево -  Стандартная обработка
&НаКлиенте
Процедура ПредставлениеПользователяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УстановитьНовогоВладельца(ВыбранноеЗначение);
	
	ОбновитьПредставлениеПользователя();

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПользователяОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Запись.Владелец = Неопределено;
	ОбновитьПредставлениеПользователя();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Установить нового владельца.
// 
// Параметры:
//  ВыбранноеЗначение - см. ПредставлениеПользователяОбработкаВыбора.ВыбранноеЗначение
&НаСервере
Процедура УстановитьНовогоВладельца(Знач ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("УникальныйИдентификатор") Тогда
		Запись.Владелец = ВыбранноеЗначение;
	ИначеЕсли ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Запись.Владелец = ВыбранноеЗначение.ИдентификаторПользователяИБ;
	КонецЕсли; // BSLLS:IfElseIfEndsWithElse-off
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеПользователя()
	
	ДанныеПредставления = УправлениеПлатформеннымиОбработками.ПредставлениеПользователяИБ(Запись.Владелец);
	ПредставлениеПользователя = ДанныеПредставления.Текст;
	Элементы.ПредставлениеПользователя.ЦветТекста = ДанныеПредставления.ЦветТекста;
	Элементы.Владелец.ЦветТекста = ДанныеПредставления.ЦветТекста;
	Элементы.Владелец.Видимость = ЗначениеЗаполнено(Запись.Владелец);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяФормыВыбораПользователя(ПодсистемаПользователейСуществует)
	
	Если ПодсистемаПользователейСуществует Тогда
		Возврат "Справочник.Пользователи.ФормаВыбора";
	Иначе
		Возврат Метаданные.РегистрыСведений.ПодменаПлатформенныхОбработок.Формы.ФормаВыбораПользователяИБ.ПолноеИмя();
	КонецЕсли;
	
КонецФункции

#КонецОбласти
